# BaseImportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BaseImportOptions Methods
BaseImportOptions Class See Also
---
The BaseImportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDefaultLengthUnit | Get the default length unit used for importing unitless files. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLayerSelection | Get all set layers name which user want to import into Revit. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetDefaultLengthUnit | Set the default length unit used for importing unitless files. |
| SetLayerSelection | Set the layers name which user want to import into Revit. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace